app/controllers/orders_controller.rb

  def create
   product= Product.find(params[:product_id]).price

    @order= Order.new({
                              quantity: params[:quantity],
                              product_id: params[:product_id],
                              user_id: current_user.id})


    @order.subtotal = @order.calc_subtotal(price)
    @order.tax = @order.calc_tax(0.09)
    @order.total = @order.calc_total

    @order.save
---
INSERT INTO `orders` (`quantity`, `created_at`, `updated_at`) VALUES (6, '2016-01-28 02:49:18', '2016-01-28 02:49:18')