app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 1
---
  def one
    @products = Product.last

SELECT `products`.* FROM `products` WHERE (price >= 'discount')
---
  def index
    @products = Product.all

INSERT INTO `images` (`product_id`, `created_at`, `updated_at`) VALUES (15, '2016-01-28 02:46:23', '2016-01-28 02:46:23')
INSERT INTO `products` (`name`, `image`, `price`, `description`, `created_at`, `updated_at`) VALUES ('asdfasd', '', 0.0, 'sdfszd', '2016-01-24 19:01:29', '2016-01-24 19:01:29')
---
  def create
    @product= Product.create({
                              name: params[:name], image: params[:image], price: params[:price], description: params[:description]})

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Rebel's Backpack"], ["description", "Rule #1: There are no rules."], ["updated_at", "2016-01-19 01:46:16.229240"], ["id", 8]]
---
  def update
    @product = Product.find(params[:id])

    @product.update({
                              name: params[:name], image: params[:image], price: params[:price], description: params[:description]
                              })

SELECT `products`.* FROM `products`
---
  def random
    @product = Product.all.sample

SELECT `products`.* FROM `products` WHERE (name LIKE '%shirt%' OR description LIKE '%shirt%')
---
  def search
    @products = Product.where("name LIKE ? OR description LIKE ?", "%#{params[:search]}%", "%#{params[:search]}%")