app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 1
---
  def one
    @products = Product.first