app/views/products/new.html.erb


  <%= collection_select :supplier, :supplier_id, Supplier.all, :name, :name %>
---
SELECT `suppliers`.* FROM `suppliers`