app/views/products/show.html.erb

SELECT `images`.* FROM `images` WHERE `images`.`product_id` = 10
---
<h1><%= @product.name %></h1>
<% @product.images.each do |image| %>